tutorials/16geomParNS_review/lift/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     |                                                 |
|   \\  /    A nd           | Copyright (C) 2018 Ehsan Madadi-Kandjani        |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format    ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
convertToMeters 1.0;
vertices
(
(-8.0 0.0 0.0)
(-8.0 -8.0 0.0)
(0.5 -8.0 0.0)
(16.5 -8.0 0.0)
(16.5 0.0 0.0)
(16.5 8.0 0.0)
(0.5 8.0 0.0)
(-8.0 8.0 0.0)
(-0.5 -0.05284845461002345 0.0)
(-0.2994614694243205 0.03519550614241432 0.0)
(-0.397577245066945 -0.08155400594288648 0.0)
(0.5 -0.052848454610023465 0.0)
(-8.0 0.0 0.2)
(-8.0 -8.0 0.2)
(0.5 -8.0 0.2)
(16.5 -8.0 0.2)
(16.5 0.0 0.2)
(16.5 8.0 0.2)
(0.5 8.0 0.2)
(-8.0 8.0 0.2)
(-0.5 -0.05284845461002345 0.2)
(-0.2994614694243205 0.03519550614241432 0.2)
(-0.397577245066945 -0.08155400594288648 0.2)
(0.5 -0.052848454610023465 0.2)
);
blocks
(
// Block 0
hex (0 1 10 8 12 13 22 20)
square
(25 100 1)
simpleGrading
(1 0.02 1)

// Block 1
hex (1 2 11 10 13 14 23 22)
square
(120 100 1)
simpleGrading
(1 0.02 1)

// Block 2
hex (2 3 4 11 14 15 16 23)
square
(100 100 1)
simpleGrading
(100 0.02 1)

// Block 3
hex (11 4 5 6 23 16 17 18)
square
(100 100 1)
simpleGrading
(100 50 1)

// Block 4
hex (9 11 6 7 21 23 18 19)
square
(80 100 1)
simpleGrading
(1 50 1)

// Block 5
hex (8 9 7 0 20 21 19 12)
square
(40 100 1)
simpleGrading
(1 50 1)

);
edges
(
spline 8 10
(
(-0.5 -0.05284845461002345 -0.0)
(-0.4992085111023651 -0.05552465237027016 -0.0)
(-0.49793323061501393 -0.05806539298103846 -0.0)
(-0.4961769733656069 -0.060470666508334055 -0.0)
(-0.49394303112275223 -0.06274064607823071 -0.0)
(-0.491235164181952 -0.06487568813651434 -0.0)
(-0.488057591068302 -0.06687633392000414 -0.0)
(-0.48441497645864556 -0.06874331206818461 -0.0)
(-0.4803124174552593 -0.07047754228114729 -0.0)
(-0.47575542837017804 -0.07208013990842305 -0.0)
(-0.47074992420347433 -0.07355242133332315 -0.0)
(-0.4653022030197642 -0.074895909999129 -0.0)
(-0.45941892744454077 -0.0761123429070984 -0.0)
(-0.4531071055153345 -0.07720367740199476 -0.0)
(-0.44637407113192146 -0.0781720980488878 -0.0)
(-0.43922746435467636 -0.07902002339549845 -0.0)
(-0.4316752118006113 -0.07975011240752129 -0.0)
(-0.4237255073826339 -0.080365270360298 -0.0)
(-0.41538679362917086 -0.08086865396904415 -0.0)
(-0.4066677438086806 -0.08126367554164429 -0.0)
(-0.397577245066945 -0.08155400594288648 -0.0)
)
spline 10 11
(
(-0.397577245066945 -0.08155400594288648 -0.0)
(-0.38812438276468864 -0.08174357616693675 -0.0)
(-0.3783184261793911 -0.08183657732586007 -0.0)
(-0.3681688157085725 -0.08183745887603325 -0.0)
(-0.3576851516828413 -0.0817509249212972 -0.0)
(-0.34687718486613317 -0.08158192845154011 -0.0)
(-0.3357548086884341 -0.08133566339793429 -0.0)
(-0.324328053223479 -0.0810175544110635 -0.0)
(-0.312607080891074 -0.08063324429542826 -0.0)
(-0.3006021838314635 -0.08018857906301269 -0.0)
(-0.28832378286815274 -0.07968959059940336 -0.0)
(-0.2757824279464348 -0.07914247696798828 -0.0)
(-0.2629887999081189 -0.07855358041062216 -0.0)
(-0.24995371343914013 -0.07792936313636474 -0.0)
(-0.23668812100631575 -0.07727638102300571 -0.0)
(-0.22320311758289374 -0.07660125538857993 -0.0)
(-0.20950994595001987 -0.07591064302142703 -0.0)
(-0.1956200023530531 -0.07521120468704032 -0.0)
(-0.18154484228790768 -0.07450957235745874 -0.0)
(-0.16729618619330489 -0.07381231543377428 -0.0)
(-0.1528859248299122 -0.07312590625398221 -0.0)
(-0.13832612413661655 -0.07245668519644345 -0.0)
(-0.12362902936737064 -0.07181082570327116 -0.0)
(-0.10880706832876558 -0.07119429955766236 -0.0)
(-0.09377163373415942 -0.07060754450886136 -0.0)
(-0.07849366824713633 -0.07000873885439371 -0.0)
(-0.063134426354295 -0.0693910048045367 -0.0)
(-0.04770831288899846 -0.0687583066221302 -0.0)
(-0.032229845100747445 -0.06811448008567486 -0.0)
(-0.0167136415055405 -0.06746321181005818 -0.0)
(-0.0011744101024450115 -0.06680802033115801 -0.0)
(0.014373064017244364 -0.066152239137117 -0.0)
(0.029913931633673507 -0.06549900180045046 -0.0)
(0.045433292893270916 -0.06485122933475365 -0.0)
(0.060916211287302735 -0.06421161986810824 -0.0)
(0.07634772806220469 -0.06358264069285158 -0.0)
(0.0917128770066733 -0.06296652271869155 -0.0)
(0.10699669955879942 -0.062365257323723916 -0.0)
(0.12218426017619377 -0.06178059556624807 -0.0)
(0.13726066191301167 -0.06121404968985721 -0.0)
(0.1522110621499404 -0.06066689682555394 -0.0)
(0.16702068842642692 -0.060140184768031575 -0.0)
(0.18167485432855068 -0.05963473967914068 -0.0)
(0.1961589753908196 -0.05915117555025705 -0.0)
(0.21045858497555348 -0.05868990523706091 -0.0)
(0.22455935009928618 -0.0582511528653431 -0.0)
(0.23844708718148844 -0.05783496739503476 -0.0)
(0.25210777769673554 -0.0574412371218148 -0.0)
(0.26552758371700125 -0.05706970489141386 -0.0)
(0.27869286333585674 -0.05671998380109257 -0.0)
(0.29159018597086184 -0.056391573165633355 -0.0)
(0.3042063475441572 -0.05608387453141435 -0.0)
(0.3165283855441371 -0.055796207531540354 -0.0)
(0.3285435939729735 -0.05552782538734083 -0.0)
(0.3402395381856248 -0.05527792987653431 -0.0)
(0.35160406962577884 -0.0550456856056684 -0.0)
(0.36262534046293826 -0.05483023344373068 -0.0)
(0.3732918181326026 -0.05463070299470163 -0.0)
(0.38359229977829545 -0.05444622400889382 -0.0)
(0.393515926590129 -0.054275936655783466 -0.0)
(0.4030521980297974 -0.05411900060427782 -0.0)
(0.41219098592650705 -0.053974602879568054 -0.0)
(0.42092254842251864 -0.05384196448849672 -0.0)
(0.42923754374089307 -0.053720345827330804 -0.0)
(0.4371270437418586 -0.05360905090662936 -0.0)
(0.44458254722815305 -0.05350743044718215 -0.0)
(0.45159599295390895 -0.05341488391848771 -0.0)
(0.45815977228633886 -0.05333086060666131 -0.0)
(0.46426674146479185 -0.05325485981180018 -0.0)
(0.4699102333978511 -0.053186430285507076 -0.0)
(0.4750840689361625 -0.05312516902734532 -0.0)
(0.4797825675567253 -0.053070719564386214 -0.0)
(0.4840005573935361 -0.053022769840677234 -0.0)
(0.4877333845498032 -0.05298104984340409 -0.0)
(0.4909769216284837 -0.052945329089811456 -0.0)
(0.4937275754206172 -0.052915414093671904 -0.0)
(0.4959822936948366 -0.052891145922401024 -0.0)
(0.4977385710364468 -0.05287239794598853 -0.0)
(0.498994453690496 -0.0528590738669701 -0.0)
(0.4997485433702241 -0.052851106106954274 -0.0)
(0.5 -0.05284845461002344 -0.0)
)
spline 8 9
(
(-0.5 -0.05284845461002345 -0.0)
(-0.4993849912374731 -0.04434109765210189 -0.0)
(-0.49817167019172565 -0.04138697564663176 -0.0)
(-0.49645317641318576 -0.03837783632222279 -0.0)
(-0.49422965966038673 -0.03531724313162406 -0.0)
(-0.49150178548010187 -0.03220944983405115 -0.0)
(-0.48827074367337175 -0.029059376385209525 -0.0)
(-0.48453825730676503 -0.025872580371652642 -0.0)
(-0.4803065920916792 -0.022655224220400273 -0.0)
(-0.47557856593446124 -0.01941403844669346 -0.0)
(-0.4703575584437107 -0.01615628123237417 -0.0)
(-0.46464752016864663 -0.012889694654396128 -0.0)
(-0.4584529813340981 -0.009622457907151237 -0.0)
(-0.45177905983369154 -0.006363137883409642 -0.0)
(-0.4446314682432523 -0.0031206374965197237 -0.0)
(-0.4370165196213097 9.585785909107386e-05 0.0)
(-0.4289411318728442 0.0032769353012809532 0.0)
(-0.42041283046588124 0.006413010492533108 0.0)
(-0.4114397493080025 0.009494384293152712 0.0)
(-0.40203062961100167 0.012511299617870952 0.0)
(-0.39219481659639815 0.01545399808299483 0.0)
(-0.3819422539218871 0.018312776039740297 0.0)
(-0.37128347573857023 0.021078039601738777 0.0)
(-0.3602295963204144 0.023740358290820565 0.0)
(-0.3487922972402545 0.026290516944903905 0.0)
(-0.3369838121001729 0.028719565554968185 0.0)
(-0.32481690885761577 0.031018866724423624 0.0)
(-0.312304869821513 0.03318014047341804 0.0)
(-0.2994614694243205 0.03519550614241432 0.0)
)
spline 9 11
(
(-0.2994614694243205 0.03519550614241432 0.0)
(-0.2863009499056959 0.037057521183340256 0.0)
(-0.27283799507087764 0.038759216662342125 0.0)
(-0.25908770231123107 0.04029412933519361 0.0)
(-0.24506555309539946 0.04165633019423186 0.0)
(-0.230787382156653 0.042840449423789936 0.0)
(-0.2162693456150528 0.043841697738926835 0.0)
(-0.2015278882817274 0.04465588411927547 0.0)
(-0.18657971039677046 0.04527942998548394 0.0)
(-0.1714417340519866 0.04570937989947878 0.0)
(-0.15613106954503525 0.04594340890111691 0.0)
(-0.14066498190261295 0.045979826622233946 0.0)
(-0.1250608577974841 0.04581757834420845 0.0)
(-0.10933617306777715 0.045456243186568795 0.0)
(-0.09360968085156529 0.04490178910983755 0.0)
(-0.07794079679309462 0.044206387643439524 0.0)
(-0.06219880721000948 0.04338436636171408 0.0)
(-0.046400000429515864 0.04243845021829164 0.0)
(-0.030560674428566026 0.04137165744723707 0.0)
(-0.014697117572587903 0.04018728413697724 0.0)
(0.0011744101024449005 0.03888888888888889 0.0)
(0.01703769506088393 0.03748027772723035 0.0)
(0.032876587895639964 0.0359654894051543 0.0)
(0.04867502042524341 0.03434878122787001 0.0)
(0.06441702227700152 0.032634615489094326 0.0)
(0.08008673697802604 0.03082764659122046 0.0)
(0.0956684375790513 0.028932708893635542 0.0)
(0.11114654183774286 0.026954805307809956 0.0)
(0.12650562698866108 0.024899096632645043 0.0)
(0.1417304441262175 0.022770891599550078 0.0)
(0.1568059322250066 0.020575637574256775 0.0)
(0.17171723181886445 0.018318911841861227 0.0)
(0.186449698356127 0.016006413383362394 0.0)
(0.20098891524396112 0.013643955036345246 0.0)
(0.21532070658951918 0.011237455919698228 0.0)
(0.22943114964026057 0.008792933992541649 0.0)
(0.243306586920227 0.006316498611032971 0.0)
(0.2569336380536358 0.003814342943473964 0.0)
(0.27029921126199574 0.0012927361041967927 0.0)
(0.28339051451627406 -0.0012419851299828588 -0.0)
(0.2961950663216111 -0.0037834251504977254 -0.0)
(0.3087007061088194 -0.006325139015230519 -0.0)
(0.32089560420455265 -0.00886064272220731 -0.0)
(0.3327682713506783 -0.011383424352001001 -0.0)
(0.3443075677430639 -0.01388695615500253 -0.0)
(0.3555027115607686 -0.016364707640746212 -0.0)
(0.36634328695847307 -0.018810159705939605 -0.0)
(0.376819251497857 -0.02121681981614172 -0.0)
(0.3869209429974936 -0.02357823823355184 -0.0)
(0.3966390857855614 -0.02588802526052475 -0.0)
(0.40596479634515004 -0.02813986944562756 -0.0)
(0.41488958834805467 -0.030327556676710152 -0.0)
(0.4234053770794962 -0.03244499006395806 -0.0)
(0.4315044832630506 -0.03448621049562916 -0.0)
(0.43917963630200485 -0.036445417730475514 -0.0)
(0.44642397696021474 -0.038316991874063844 -0.0)
(0.4532310595121104 -0.04009551507160099 -0.0)
(0.45959485339764217 -0.041775793237715395 -0.0)
(0.4655097444234595 -0.04335287763413596 -0.0)
(0.47097053555637447 -0.044822086099516774 -0.0)
(0.47597244735899114 -0.046179023731897986 -0.0)
(0.4805111181202175 -0.04741960282353759 -0.0)
(0.484582603735095 -0.04854006185011323 -0.0)
(0.48818337738894424 -0.049536983321559966 -0.0)
(0.4913103291002051 -0.050407310309991085 -0.0)
(0.4939607651745206 -0.05114836148113233 -0.0)
(0.49613240761964117 -0.05175784446931846 -0.0)
(0.4978233935666332 -0.05223386745214594 -0.0)
(0.49903227473777556 -0.05257494879910722 -0.0)
(0.4997580169955075 -0.052780024688671996 -0.0)
(0.5 -0.052848454610023465 -0.0)
)
spline 20 22
(
(-0.5 -0.05284845461002345 0.2)
(-0.4992085111023651 -0.05552465237027016 0.2)
(-0.49793323061501393 -0.05806539298103846 0.2)
(-0.4961769733656069 -0.060470666508334055 0.2)
(-0.49394303112275223 -0.06274064607823071 0.2)
(-0.491235164181952 -0.06487568813651434 0.2)
(-0.488057591068302 -0.06687633392000414 0.2)
(-0.48441497645864556 -0.06874331206818461 0.2)
(-0.4803124174552593 -0.07047754228114729 0.2)
(-0.47575542837017804 -0.07208013990842305 0.2)
(-0.47074992420347433 -0.07355242133332315 0.2)
(-0.4653022030197642 -0.074895909999129 0.2)
(-0.45941892744454077 -0.0761123429070984 0.2)
(-0.4531071055153345 -0.07720367740199476 0.2)
(-0.44637407113192146 -0.0781720980488878 0.2)
(-0.43922746435467636 -0.07902002339549845 0.2)
(-0.4316752118006113 -0.07975011240752129 0.2)
(-0.4237255073826339 -0.080365270360298 0.2)
(-0.41538679362917086 -0.08086865396904415 0.2)
(-0.4066677438086806 -0.08126367554164429 0.2)
(-0.397577245066945 -0.08155400594288648 0.2)
)
spline 22 23
(
(-0.397577245066945 -0.08155400594288648 0.2)
(-0.38812438276468864 -0.08174357616693675 0.2)
(-0.3783184261793911 -0.08183657732586007 0.2)
(-0.3681688157085725 -0.08183745887603325 0.2)
(-0.3576851516828413 -0.0817509249212972 0.2)
(-0.34687718486613317 -0.08158192845154011 0.2)
(-0.3357548086884341 -0.08133566339793429 0.2)
(-0.324328053223479 -0.0810175544110635 0.2)
(-0.312607080891074 -0.08063324429542826 0.2)
(-0.3006021838314635 -0.08018857906301269 0.2)
(-0.28832378286815274 -0.07968959059940336 0.2)
(-0.2757824279464348 -0.07914247696798828 0.2)
(-0.2629887999081189 -0.07855358041062216 0.2)
(-0.24995371343914013 -0.07792936313636474 0.2)
(-0.23668812100631575 -0.07727638102300571 0.2)
(-0.22320311758289374 -0.07660125538857993 0.2)
(-0.20950994595001987 -0.07591064302142703 0.2)
(-0.1956200023530531 -0.07521120468704032 0.2)
(-0.18154484228790768 -0.07450957235745874 0.2)
(-0.16729618619330489 -0.07381231543377428 0.2)
(-0.1528859248299122 -0.07312590625398221 0.2)
(-0.13832612413661655 -0.07245668519644345 0.2)
(-0.12362902936737064 -0.07181082570327116 0.2)
(-0.10880706832876558 -0.07119429955766236 0.2)
(-0.09377163373415942 -0.07060754450886136 0.2)
(-0.07849366824713633 -0.07000873885439371 0.2)
(-0.063134426354295 -0.0693910048045367 0.2)
(-0.04770831288899846 -0.0687583066221302 0.2)
(-0.032229845100747445 -0.06811448008567486 0.2)
(-0.0167136415055405 -0.06746321181005818 0.2)
(-0.0011744101024450115 -0.06680802033115801 0.2)
(0.014373064017244364 -0.066152239137117 0.2)
(0.029913931633673507 -0.06549900180045046 0.2)
(0.045433292893270916 -0.06485122933475365 0.2)
(0.060916211287302735 -0.06421161986810824 0.2)
(0.07634772806220469 -0.06358264069285158 0.2)
(0.0917128770066733 -0.06296652271869155 0.2)
(0.10699669955879942 -0.062365257323723916 0.2)
(0.12218426017619377 -0.06178059556624807 0.2)
(0.13726066191301167 -0.06121404968985721 0.2)
(0.1522110621499404 -0.06066689682555394 0.2)
(0.16702068842642692 -0.060140184768031575 0.2)
(0.18167485432855068 -0.05963473967914068 0.2)
(0.1961589753908196 -0.05915117555025705 0.2)
(0.21045858497555348 -0.05868990523706091 0.2)
(0.22455935009928618 -0.0582511528653431 0.2)
(0.23844708718148844 -0.05783496739503476 0.2)
(0.25210777769673554 -0.0574412371218148 0.2)
(0.26552758371700125 -0.05706970489141386 0.2)
(0.27869286333585674 -0.05671998380109257 0.2)
(0.29159018597086184 -0.056391573165633355 0.2)
(0.3042063475441572 -0.05608387453141435 0.2)
(0.3165283855441371 -0.055796207531540354 0.2)
(0.3285435939729735 -0.05552782538734083 0.2)
(0.3402395381856248 -0.05527792987653431 0.2)
(0.35160406962577884 -0.0550456856056684 0.2)
(0.36262534046293826 -0.05483023344373068 0.2)
(0.3732918181326026 -0.05463070299470163 0.2)
(0.38359229977829545 -0.05444622400889382 0.2)
(0.393515926590129 -0.054275936655783466 0.2)
(0.4030521980297974 -0.05411900060427782 0.2)
(0.41219098592650705 -0.053974602879568054 0.2)
(0.42092254842251864 -0.05384196448849672 0.2)
(0.42923754374089307 -0.053720345827330804 0.2)
(0.4371270437418586 -0.05360905090662936 0.2)
(0.44458254722815305 -0.05350743044718215 0.2)
(0.45159599295390895 -0.05341488391848771 0.2)
(0.45815977228633886 -0.05333086060666131 0.2)
(0.46426674146479185 -0.05325485981180018 0.2)
(0.4699102333978511 -0.053186430285507076 0.2)
(0.4750840689361625 -0.05312516902734532 0.2)
(0.4797825675567253 -0.053070719564386214 0.2)
(0.4840005573935361 -0.053022769840677234 0.2)
(0.4877333845498032 -0.05298104984340409 0.2)
(0.4909769216284837 -0.052945329089811456 0.2)
(0.4937275754206172 -0.052915414093671904 0.2)
(0.4959822936948366 -0.052891145922401024 0.2)
(0.4977385710364468 -0.05287239794598853 0.2)
(0.498994453690496 -0.0528590738669701 0.2)
(0.4997485433702241 -0.052851106106954274 0.2)
(0.5 -0.05284845461002344 0.2)
)
spline 20 21
(
(-0.5 -0.05284845461002345 0.2)
(-0.4993849912374731 -0.04434109765210189 0.2)
(-0.49817167019172565 -0.04138697564663176 0.2)
(-0.49645317641318576 -0.03837783632222279 0.2)
(-0.49422965966038673 -0.03531724313162406 0.2)
(-0.49150178548010187 -0.03220944983405115 0.2)
(-0.48827074367337175 -0.029059376385209525 0.2)
(-0.48453825730676503 -0.025872580371652642 0.2)
(-0.4803065920916792 -0.022655224220400273 0.2)
(-0.47557856593446124 -0.01941403844669346 0.2)
(-0.4703575584437107 -0.01615628123237417 0.2)
(-0.46464752016864663 -0.012889694654396128 0.2)
(-0.4584529813340981 -0.009622457907151237 0.2)
(-0.45177905983369154 -0.006363137883409642 0.2)
(-0.4446314682432523 -0.0031206374965197237 0.2)
(-0.4370165196213097 9.585785909107386e-05 0.2)
(-0.4289411318728442 0.0032769353012809532 0.2)
(-0.42041283046588124 0.006413010492533108 0.2)
(-0.4114397493080025 0.009494384293152712 0.2)
(-0.40203062961100167 0.012511299617870952 0.2)
(-0.39219481659639815 0.01545399808299483 0.2)
(-0.3819422539218871 0.018312776039740297 0.2)
(-0.37128347573857023 0.021078039601738777 0.2)
(-0.3602295963204144 0.023740358290820565 0.2)
(-0.3487922972402545 0.026290516944903905 0.2)
(-0.3369838121001729 0.028719565554968185 0.2)
(-0.32481690885761577 0.031018866724423624 0.2)
(-0.312304869821513 0.03318014047341804 0.2)
(-0.2994614694243205 0.03519550614241432 0.2)
)
spline 21 23
(
(-0.2994614694243205 0.03519550614241432 0.2)
(-0.2863009499056959 0.037057521183340256 0.2)
(-0.27283799507087764 0.038759216662342125 0.2)
(-0.25908770231123107 0.04029412933519361 0.2)
(-0.24506555309539946 0.04165633019423186 0.2)
(-0.230787382156653 0.042840449423789936 0.2)
(-0.2162693456150528 0.043841697738926835 0.2)
(-0.2015278882817274 0.04465588411927547 0.2)
(-0.18657971039677046 0.04527942998548394 0.2)
(-0.1714417340519866 0.04570937989947878 0.2)
(-0.15613106954503525 0.04594340890111691 0.2)
(-0.14066498190261295 0.045979826622233946 0.2)
(-0.1250608577974841 0.04581757834420845 0.2)
(-0.10933617306777715 0.045456243186568795 0.2)
(-0.09360968085156529 0.04490178910983755 0.2)
(-0.07794079679309462 0.044206387643439524 0.2)
(-0.06219880721000948 0.04338436636171408 0.2)
(-0.046400000429515864 0.04243845021829164 0.2)
(-0.030560674428566026 0.04137165744723707 0.2)
(-0.014697117572587903 0.04018728413697724 0.2)
(0.0011744101024449005 0.03888888888888889 0.2)
(0.01703769506088393 0.03748027772723035 0.2)
(0.032876587895639964 0.0359654894051543 0.2)
(0.04867502042524341 0.03434878122787001 0.2)
(0.06441702227700152 0.032634615489094326 0.2)
(0.08008673697802604 0.03082764659122046 0.2)
(0.0956684375790513 0.028932708893635542 0.2)
(0.11114654183774286 0.026954805307809956 0.2)
(0.12650562698866108 0.024899096632645043 0.2)
(0.1417304441262175 0.022770891599550078 0.2)
(0.1568059322250066 0.020575637574256775 0.2)
(0.17171723181886445 0.018318911841861227 0.2)
(0.186449698356127 0.016006413383362394 0.2)
(0.20098891524396112 0.013643955036345246 0.2)
(0.21532070658951918 0.011237455919698228 0.2)
(0.22943114964026057 0.008792933992541649 0.2)
(0.243306586920227 0.006316498611032971 0.2)
(0.2569336380536358 0.003814342943473964 0.2)
(0.27029921126199574 0.0012927361041967927 0.2)
(0.28339051451627406 -0.0012419851299828588 0.2)
(0.2961950663216111 -0.0037834251504977254 0.2)
(0.3087007061088194 -0.006325139015230519 0.2)
(0.32089560420455265 -0.00886064272220731 0.2)
(0.3327682713506783 -0.011383424352001001 0.2)
(0.3443075677430639 -0.01388695615500253 0.2)
(0.3555027115607686 -0.016364707640746212 0.2)
(0.36634328695847307 -0.018810159705939605 0.2)
(0.376819251497857 -0.02121681981614172 0.2)
(0.3869209429974936 -0.02357823823355184 0.2)
(0.3966390857855614 -0.02588802526052475 0.2)
(0.40596479634515004 -0.02813986944562756 0.2)
(0.41488958834805467 -0.030327556676710152 0.2)
(0.4234053770794962 -0.03244499006395806 0.2)
(0.4315044832630506 -0.03448621049562916 0.2)
(0.43917963630200485 -0.036445417730475514 0.2)
(0.44642397696021474 -0.038316991874063844 0.2)
(0.4532310595121104 -0.04009551507160099 0.2)
(0.45959485339764217 -0.041775793237715395 0.2)
(0.4655097444234595 -0.04335287763413596 0.2)
(0.47097053555637447 -0.044822086099516774 0.2)
(0.47597244735899114 -0.046179023731897986 0.2)
(0.4805111181202175 -0.04741960282353759 0.2)
(0.484582603735095 -0.04854006185011323 0.2)
(0.48818337738894424 -0.049536983321559966 0.2)
(0.4913103291002051 -0.050407310309991085 0.2)
(0.4939607651745206 -0.05114836148113233 0.2)
(0.49613240761964117 -0.05175784446931846 0.2)
(0.4978233935666332 -0.05223386745214594 0.2)
(0.49903227473777556 -0.05257494879910722 0.2)
(0.4997580169955075 -0.052780024688671996 0.2)
(0.5 -0.052848454610023465 0.2)
)
);
boundary
(
    top
{
        type wall;
faces
(
        (8 9 21 20)
        (9 11 23 21)
    );
}
    
    bottom
{
        type wall;
faces
(
        (8 10 22 20)
        (10 11 23 22)
    );
}
    
    frontAndBack
{
        type empty;
faces
(
        (8 0 1 10)
        (11 10 1 2)
        (4 11 2 3)
        (7 0 8 9)
        (6 7 9 11)
        (5 6 11 4)
        (20 12 13 22)
        (23 22 13 14)
        (16 23 14 15)
        (19 12 20 21)
        (18 19 21 23)
        (17 18 23 16)
    );
}
    
    inlet
{
        type patch;
faces
(
        (7 0 12 19)
        (0 1 13 12)
    );
}
    
    outlet
{
        type patch;
faces
(
        (4 5 17 16)
        (3 4 16 15)
    );
}
    
    sides
{
        type patch;
faces
(
        (6 7 19 18)
        (5 6 18 17)
        (2 3 15 14)
        (1 2 14 13)
    );
}
    

    );

mergePatchPairs
(
);
